import json


def get_canvas_size(form, base, size):
    sizes = {
        "Квадрат": {
            "На картоне": {"Малый": ["7x7", "10x10", "15x15", "20x20"],
                           "Средний": ["30x30", "40x40"],
                           "Большой": ["50x50"]},
            "На подрамнике": {"Малый": ["10x10", "15x15", "20x20", "25x25"],
                              "Средний": ["30x30", "40x40"],
                              "Большой": ["50x50", "60x60", "70x70", "80x80", "100x100"]}
        },
        "Прямоугольник": {
            "На картоне": {"Малый": ["15x20", "18x24", "20x30"],
                           "Средний": ["25x30", "30x40", "40x50"],
                           "Большой": ["50x70"]},
            "На подрамнике": {"Малый": ["18x24", "20x30", "24x30"],
                              "Средний": ["25x35", "30x40", "40x50"],
                              "Большой": ["40x55", "40x60", "50x70", "60x100", "60x120", "100x150"]}
        },
        "Круг": {
            "На картоне": {"Малый": ["7,5", "10", "15", "18", "20", "24"],
                           "Средний": ["30", "40", "45"],
                           "Большой": ["50", "60", "70", "75"]},
            "На подрамнике": {"Малый": ["На магните", "На магните"],
                              "Средний": ["30", "35", "40"],
                              "Большой": ["50", "60"]}
        },
        "Овал": {
            "На картоне": {"Малый": ["20x30", "25x30"],
                           "Средний": ["30x40"],
                           "Большой": ["55x65"]},
            "На подрамнике": {"Малый": ["20x30", "25x35"],
                              "Средний": ["30x40", "40x50"],
                              "Большой": ["50x60"]}
        }
    }

    return sizes[form][base][size]


sizes = {
    "Квадрат": {
        "На картоне": {"Малый": {"7x7": 300, "10x10": 600, "15x15": 1500, "20x20": 2500},
                       "Средний": {"30x30": 5500, "40x40": 10000},
                       "Большой": {"50x50": 13500}},
        "На подрамнике": {"Малый": {"На магните": 350, "10x10": 650, "15x15": 1700, "20x20": 3000, "25x25": 4000},
                          "Средний": {"30x30": 5800, "40x40": 10500},
                          "Большой": {"50x50": 14500, "60x60": 20000, "70x70": 27500, "80x80": 35500, "100x100": 47500}}
    },
    "Прямоугольник": {
        "На картоне": {"Малый": {"15x20": 2000, "18x24": 2500, "20x30": 3500},
                       "Средний": {"25x30": 4500, "30x40": 7000, "40x50": 12000},
                       "Большой": {"50x70": 17500}},
        "На подрамнике": {"Малый": {"18x24": 3000, "20x30": 4000, "24x30": 4700},
                          "Средний": {"25x35": 5000, "30x40": 7500, "40x50": 12500},
                          "Большой": {"40x55": 14000, "40x60": 15000, "50x70": 20000, "70x90": 35000, "60x100": 33000,
                                      "60x120": 38000, "100x150": 71000}}
    },
    "Круг": {
        "На картоне": {"Малый": {"7,5": 300, "10": 500, "15": 1500, "18": 2000, "20": 2500, "24": 3000},
                       "Средний": {"30": 4500, "40": 8000, "45": 10000},
                       "Большой": {"50": 12000}},
        "На подрамнике": {"Малый": {"20": 3000, "25": 3500},
                          "Средний": {"30": 5000, "35": 5500, "40": 9000, "45": 11000},
                          "Большой": {"50": 13000, "60": 17000, "70": 23500, "75": 26500}}
    },
    "Овал": {
        "На картоне": {"Малый": {"20x30": 3300, "25x30": 4000},
                       "Средний": {"30x40": 5500}},
        "На подрамнике": {"Малый": {"20x30": 3500, "25x35": 4500},
                          "Средний": {"30x40": 6500, "40x50": 12000},
                          "Большой": {"50x60": 15000, "55x65": 18000}}
    },
    "Нестандартный формат": {
        "Треугольник": {"На картоне": {"20": 2000, "30": 3500}},
        "Шестигранник": {"На картоне": {"8,5x10": 700, "12x14": 1700, "20x30": 4000}},
        "Сердце": {"На картоне": {"7,5x7,5": 500, "20х17,5": 2000, "26x30": 3600, "35x40": 6400}}
    }
}

with open('info.json', 'w') as f:
    json.dump(sizes, f)
